src/Catalogs/Roles_AccessProfiles/Roles_AccessProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessProfiles</name>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>CatalogRef.Roles_AccessRoles</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Roles_AccessRoles/Roles_AccessRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessRoles</name>
  <basedOn>Catalog.Roles_AccessProfiles</basedOn>
  <basedOn>Catalog.Users</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SetRightsForNewNativeObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRightsForAttributesAndTabularSectionsByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubordinateObjectsHaveIndependentRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfigRoles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RestrictionByCondition</name>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fields</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Templates</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Template</name>
      <type>
        <types>CatalogRef.Roles_Templates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LangInfo</name>
    <attributes>
      <name>LangCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LangDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Roles_AccessProfiles/Forms/ItemForm/Module.bsl
&AtClient
Procedure UpdateMatrix(Command)
	UpdateMatrixAtServer();
EndProcedure

&AtServer
Procedure UpdateMatrixAtServer()
	
	RoleTree = Roles_SettingsReUse.RoleTree();
	
	Query = New Query;
	Query.Text =
		"SELECT
		|	Roles_AccessRoles.Ref
		|INTO Roles
		|FROM
		|	Catalog.Roles_AccessRoles AS Roles_AccessRoles
		|WHERE
		|	Roles_AccessRoles.Ref IN (&Ref)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Roles_AccessRolesRights.Ref,
		|	Roles_AccessRolesRights.ObjectType,
		|	Roles_AccessRolesRights.ObjectName,
		|	Roles_AccessRolesRights.RightName,
		|	Roles_AccessRolesRights.RowID,
		|	Roles_AccessRolesRights.ObjectPath,
		|	Roles_AccessRolesRights.RightValue,
		|	Roles_AccessRolesRights.Disable
		|FROM
		|	Roles AS Roles
		|		INNER JOIN Catalog.Roles_AccessRoles.Rights AS Roles_AccessRolesRights
		|		ON Roles_AccessRolesRights.Ref = Roles.Ref
		|WHERE
		|	NOT Roles_AccessRolesRights.Disable
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Roles_AccessRolesRestrictionByCondition.Ref,
		|	Roles_AccessRolesRestrictionByCondition.RowID,
		|	Roles_AccessRolesRestrictionByCondition.Fields,
		|	Roles_AccessRolesRestrictionByCondition.Condition
		|FROM
		|	Roles AS Roles
		|		INNER JOIN Catalog.Roles_AccessRoles.RestrictionByCondition AS Roles_AccessRolesRestrictionByCondition
		|		ON Roles_AccessRolesRestrictionByCondition.Ref = Roles.Ref";
	
	Query.SetParameter("Ref", Object.Roles.Unload().UnloadColumn("Role"));
	
	QueryResult = Query.ExecuteBatch();
	
	ObjectData = New Structure;
	ObjectData.Insert("RightTable", QueryResult[1].Unload());
	ObjectData.Insert("RestrictionByCondition", QueryResult[2].Unload());
	ObjectData.Insert("SetRightsForNewNativeObjects", True);
	ObjectData.Insert("SetRightsForAttributesAndTabularSectionsByDefault", True);
	ObjectData.Insert("SubordinateObjectsHaveIndependentRights", True);
	TabDocMartix = Roles_RoleMatrix.GenerateRoleMatrix(RoleTree, ObjectData, True, True);

EndProcedure
